In [1]:
import pandas as pd

In [4]:
loan_data = pd.read_csv('datasets/loan_small.csv')
display(loan_data) # Display the data

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
1,LP001003,Male,4583.0,NaN,128.0,semi,N
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
4,LP001008,Male,NaN,0.0,141.0,urban,Y
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y
6,LP001013,Male,2333.0,1516.0,NaN,rural,Y
7,LP001014,Female,3036.0,2504.0,158.0,semi,N
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y
9,LP001020,Male,12841.0,10968.0,349.0,semi,N
10,LP001024,Female,3200.0,700.0,70.0,urban,Y
11,LP001027,Male,2500.0,1840.0,109.0,urban,Y
12,LP001028,Female,NaN,8106.0,NaN,urban,Y
13,LP001029,Male,1853.0,2840.0,114.0,urban,N
14,LP001030,Male,1299.0,1086.0,17.0,semi,Y
15,LP001032,Male,4950.0,0.0,125.0,semi,Y

In [5]:
loan_data.sample(10) # Randomly sample 10 rows

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
8,LP001018,Male,4006.0,1526.0,168.0,rural,Y
4,LP001008,Male,NaN,0.0,141.0,urban,Y
10,LP001024,Female,3200.0,700.0,70.0,urban,Y
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y
3,LP001006,Female,2583.0,2358.0,120.0,semi,NaN
0,LP001002,NaN,5849.0,0.0,NaN,urban,Y
6,LP001013,Male,2333.0,1516.0,NaN,rural,Y
14,LP001030,Male,1299.0,1086.0,17.0,semi,Y
11,LP001027,Male,2500.0,1840.0,109.0,urban,Y
2,LP001005,Male,3000.0,0.0,66.0,NaN,Y

In [6]:
loan_data.shape # Get the shape i.e. dimensions of the data frame

(16, 7)

In [7]:
loan_data.info() # Get the information about the data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            16 non-null     object
 1   Gender             15 non-null     object
 2   ApplicantIncome    14 non-null     float64
 3   CoapplicantIncome  15 non-null     float64
 4   LoanAmount         13 non-null     float64
 5   Area               15 non-null     object
 6   Loan_Status        15 non-null     object
dtypes: float64(3), object(4)
memory usage: 1.0+ KB

In [9]:
loan_data.describe() 
# Get the summary statistics of the data frame. 
# Includes only the numerical columns.

       ApplicantIncome  CoapplicantIncome  LoanAmount
count        14.000000          15.000000   13.000000
mean       4103.571429        2509.333333  140.923077
std        2858.096481        3147.982090   86.032418
min        1299.000000           0.000000   17.000000
25%        2520.750000         350.000000  109.000000
50%        3118.000000        1526.000000  125.000000
75%        4858.250000        2672.000000  158.000000
max       12841.000000       10968.000000  349.000000

In [13]:
loan_data.select_dtypes(include='number').skew() 
# Get the skewness of the data frame
# Skewness measures the asymmetry of the distribution of data around its mean.
# It throws error if DataFrame contains non-numeric columns as well. Use only numeric columns.

ApplicantIncome      2.403941
CoapplicantIncome    1.878692
LoanAmount           1.282141
dtype: float64

<img src="/images/skewness.png" alt="Understanding Skewness">

![](/images/skewness.png)

In [16]:
Q1 = loan_data.select_dtypes(include='number').quantile(0.25, axis = 0) # 25% of the data

print('First_Quartile :\n', Q1)

First_Quartile :
 ApplicantIncome      2520.75
CoapplicantIncome     350.00
LoanAmount            109.00
Name: 0.25, dtype: float64

In [17]:
Q3 = loan_data.select_dtypes(include='number').quantile(0.75, axis = 0) # 75% of the data

print('Third_Quartile :\n', Q3)

Third_Quartile :
 ApplicantIncome      4858.25
CoapplicantIncome    2672.00
LoanAmount            158.00
Name: 0.75, dtype: float64

The 25th(Q1) and 75th(Q3) quartiles are obtained and Inter quartile range(IQR) is obtained from Q3 and Q1

In [18]:
IQR = Q3 - Q1

print('Inter Quartile Range :\n', IQR)

Inter Quartile Range :
 ApplicantIncome      2337.5
CoapplicantIncome    2322.0
LoanAmount             49.0
dtype: float64

Outliers are detected using IQR method i.e An outlier is a point which falls more than 1.5 times the interquartile range above the third quartile or below the first quartile.

In [21]:
# Only the outlier rows are displayed 
loan_data_outliers = loan_data[((loan_data.select_dtypes(include='number') < (Q1 - 1.5 * IQR)) |\
                                    (loan_data.select_dtypes(include='number') > (Q3 + 1.5 * IQR))).any(axis = 1)]

loan_data_outliers

,Loan_ID,Gender,ApplicantIncome,CoapplicantIncome,LoanAmount,Area,Loan_Status
5,LP001011,Male,5417.0,4196.0,267.0,semi,Y
9,LP001020,Male,12841.0,10968.0,349.0,semi,N
12,LP001028,Female,NaN,8106.0,NaN,urban,Y
14,LP001030,Male,1299.0,1086.0,17.0,semi,Y

In [22]:
loan_data.isnull().sum()

Loan_ID              0
Gender               1
ApplicantIncome      2
CoapplicantIncome    1
LoanAmount           3
Area                 1
Loan_Status          1
dtype: int64